PX4/PX4-Autopilot/nuttx/arch/arm/src/kinetis/kinetis_serial.c
static int up_setup(struct uart_dev_s *dev)
{
#ifndef CONFIG_SUPPRESS_UART_CONFIG
  struct up_dev_s *priv = (struct up_dev_s*)dev->priv;

  /* Configure the UART as an RS-232 UART */

  kinetis_uartconfigure(priv->uartbase, priv->baud, priv->clock,
                        priv->parity, priv->bits);
#endif

  /* Make sure that all interrupts are disabled */

  up_restoreuartint(priv, 0);

  /* Set up the interrupt priority */

  up_prioritize_irq(priv->irqs, priv->irqprio);
#ifdef CONFIG_DEBUG
  up_prioritize_irq(priv->irqe, priv->irqprio);
#endif
  return OK;
}

/****************************************************************************
 * Name: up_shutdown
 *
 * Description:
 *   Disable the UART.  This method is called when the serial
 *   port is closed
 *
 ****************************************************************************/

static void up_shutdown(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s*)dev->priv;

  /* Disable interrupts */

  up_restoreuartint(priv, 0);

  /* Reset hardware and disable Rx and Tx */

  kinetis_uartreset(priv->uartbase);
}

/****************************************************************************
 * Name: up_attach
 *
 * Description:
 *   Configure the UART to operation in interrupt driven mode.  This method is
 *   called when the serial port is opened.  Normally, this is just after the
 *   the setup() method is called, however, the serial console may operate in
 *   a non-interrupt driven mode during the boot phase.
 *
 *   RX and TX interrupts are not enabled when by the attach method (unless the
 *   hardware supports multiple levels of interrupt enabling).  The RX and TX
 *   interrupts are not enabled until the txint() and rxint() methods are called.
 *
 ****************************************************************************/

static int up_attach(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s*)dev->priv;
  int ret;

  /* Attach and enable the IRQ(s).  The interrupts are (probably) still
   * disabled in the C2 register.
   */

  ret = irq_attach(priv->irqs, up_interrupts);
#ifdef CONFIG_DEBUG
  if (ret == OK)
    {
      ret = irq_attach(priv->irqe, up_interrupte);
    }
#endif

  if (ret == OK)
    {
#ifdef CONFIG_DEBUG
      up_enable_irq(priv->irqe);
#endif
      up_enable_irq(priv->irqs);
    }

  return ret;
}

/****************************************************************************
 * Name: up_detach
 *
 * Description:
 *   Detach UART interrupts.  This method is called when the serial port is
 *   closed normally just before the shutdown method is called.  The exception
 *   is the serial console which is never shutdown.
 *
 ****************************************************************************/

static void up_detach(struct uart_dev_s *dev)
{
  struct up_dev_s *priv = (struct up_dev_s*)dev->priv;
  
  /* Disable interrupts */

  up_restoreuartint(priv, 0);
#ifdef CONFIG_DEBUG
  up_disable_irq(priv->irqe);
#endif
  up_disable_irq(priv->irqs);

  /* Detach from the interrupt(s) */

  irq_detach(priv->irqs);
#ifdef CONFIG_DEBUG
  irq_detach(priv->irqe);
#endif
}

/****************************************************************************
 * Name: up_interrupte
 *
 * Description:
 *   This is the UART error interrupt handler.  It will be invoked when an
 *   interrupt received on the 'irq'
 *
 ****************************************************************************/

#ifdef CONFIG_DEBUG
static int up_interrupte(int irq, void *context)
{
  struct uart_dev_s *dev = NULL;
  struct up_dev_s   *priv;
  uint8_t            regval;

#ifdef CONFIG_KINETIS_UART0
  if (g_uart0priv.irqe == irq)
    {
      dev = &g_uart0port;
    }
  else
#endif
#ifdef CONFIG_KINETIS_UART1
  if (g_uart1priv.irqe == irq)
    {
      dev = &g_uart1port;
    }
  else
#endif
#ifdef CONFIG_KINETIS_UART2
  if (g_uart2priv.irqe == irq)
    {
      dev = &g_uart2port;
    }
  else
#endif
#ifdef CONFIG_KINETIS_UART3
  if (g_uart3priv.irqe == irq)
    {
      dev = &g_uart3port;
    }
  else
#endif
#ifdef CONFIG_KINETIS_UART4
  if (g_uart4priv.irqe == irq)
    {
      dev = &g_uart4port;
    }
  else
#endif
#ifdef CONFIG_KINETIS_UART5
  if (g_uart5priv.irqe == irq)
    {
      dev = &g_uart5port;
    }
  else
#endif
    {
      PANIC(OSERR_INTERNAL);
    }
  priv = (struct up_dev_s*)dev->priv;
  DEBUGASSERT(priv);

  /* Handle error interrupts.  This interrupt may be caused by:
   *
   * FE: Framing error. To clear FE, read S1 with FE set and then read the
   *     UART data register (D).
   * NF: Noise flag. To clear NF, read S1 and then read the UART data
   *     register (D).
   * PF: Parity error flag. To clear PF, read S1 and then read the UART data
   *     register (D).
   */

  regval = up_serialin(priv, KINETIS_UART_S1_OFFSET);
  lldbg("S1: %02x\n", regval);
  regval = up_serialin(priv, KINETIS_UART_D_OFFSET);
  return OK;
}
#endif /* CONFIG_DEBUG */

/****************************************************************************
 * Name: up_interrupts
 *
 * Description:
 *   This is the UART status interrupt handler.  It will be invoked when an
 *   interrupt received on the 'irq'  It should call uart_transmitchars or
 *   uart_receivechar to perform the appropriate data transfers.  The
 *   interrupt handling logic must be able to map the 'irq' number into the
 *   approprite uart_dev_s structure in order to call these functions.
 *
 ****************************************************************************/

static int up_interrupts(int irq, void *context)
{
  struct uart_dev_s *dev = NULL;
  struct up_dev_s   *priv;
  int                passes;
#ifdef CONFIG_KINETIS_UARTFIFOS
  unsigned int       count;
#else
  uint8_t            s1;
#endif
  bool               handled;

#ifdef CONFIG_KINETIS_UART0
  if (g_uart0priv.irqs == irq)
    {
      dev = &g_uart0port;
    }
  else
#endif
#ifdef CONFIG_KINETIS_UART1
  if (g_uart1priv.irqs == irq)
    {
      dev = &g_uart1port;
    }
  else
#endif
#ifdef CONFIG_KINETIS_UART2
  if (g_uart2priv.irqs == irq)
    {
      dev = &g_uart2port;
    }
  else
#endif
#ifdef CONFIG_KINETIS_UART3
  if (g_uart3priv.irqs == irq)
    {
      dev = &g_uart3port;
    }
  else
#endif
#ifdef CONFIG_KINETIS_UART4
  if (g_uart4priv.irqs == irq)
    {
      dev = &g_uart4port;
    }
  else
#endif
#ifdef CONFIG_KINETIS_UART5
  if (g_uart5priv.irq == irqs)
    {
      dev = &g_uart5port;
    }
  else
#endif
    {
      PANIC(OSERR_INTERNAL);
    }
  priv = (struct up_dev_s*)dev->priv;
  DEBUGASSERT(priv);

  /* Loop until there are no characters to be transferred or,
   * until we have been looping for a long time.
   */

  handled = true;
  for (passes = 0; passes < 256 && handled; passes++)
    {
      handled = false;

